INSERT INTO Faculty (faculty_id, faculty_name, faculty_dean, faculty_substitute)
VALUES
    ('550e8400-e29b-41d4-a716-446655440000', 'Математический', 'Иванов Иван Иванович', 'Петров Петр Петрович'),
    ('550e8400-e29b-41d4-a716-446655440001', 'Исторический', 'Сидоров Александр Викторович', 'Кузнецова Ольга Сергеевна'),
    ('550e8400-e29b-41d4-a716-446655440002', 'Юридический', 'Попова Мария Андреевна', 'Васильев Николай Павлович'),
    ('550e8400-e29b-41d4-a716-446655440003', 'Информационно-вычислительных технологий', 'Смирнов Дмитрий Александрович', 'Воронов Алексей Игоревич');



INSERT INTO Departments (department_id, faculty_id, department_name, head_of_department)
VALUES
    -- Математический факультет
    ('660e8400-e29b-41d4-a716-446655440000', '550e8400-e29b-41d4-a716-446655440000', 'Кафедра алгебры', 'Зайцев Олег Петрович'),
    ('660e8400-e29b-41d4-a716-446655440001', '550e8400-e29b-41d4-a716-446655440000', 'Кафедра геометрии', 'Лебедев Сергей Николаевич'),

    -- Исторический факультет
    ('660e8400-e29b-41d4-a716-446655440002', '550e8400-e29b-41d4-a716-446655440001', 'Кафедра отечественной истории', 'Фролов Дмитрий Евгеньевич'),
    ('660e8400-e29b-41d4-a716-446655440003', '550e8400-e29b-41d4-a716-446655440001', 'Кафедра всеобщей истории', 'Голубева Анна Владимировна'),

    -- Юридический факультет
    ('660e8400-e29b-41d4-a716-446655440004', '550e8400-e29b-41d4-a716-446655440002', 'Кафедра гражданского права', 'Тарасов Игорь Павлович'),
    ('660e8400-e29b-41d4-a716-446655440005', '550e8400-e29b-41d4-a716-446655440002', 'Кафедра уголовного права', 'Шмидт Виталий Анатольевич'),

    -- Информационно-вычислительных технологий факультет
    ('660e8400-e29b-41d4-a716-446655440006', '550e8400-e29b-41d4-a716-446655440003', 'Кафедра программирования', 'Козлов Андрей Олегович'),
    ('660e8400-e29b-41d4-a716-446655440007', '550e8400-e29b-41d4-a716-446655440003', 'Кафедра сетевых технологий', 'Савин Михаил Евгеньевич');


INSERT INTO Scientific_Supervisor (supervisor_id, department_id, full_name)
VALUES
    -- Математический факультет, Кафедра алгебры
    ('880e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440000', 'Пифагор Самосский'),

    -- Математический факультет, Кафедра геометрии
    ('880e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440001', 'Эвклид Александрийский'),

    -- Исторический факультет, Кафедра отечественной истории
    ('880e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440002', 'Иван Грозный'),

    -- Исторический факультет, Кафедра всеобщей истории
    ('880e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440003', 'Александр Македонский'),

    -- Юридический факультет, Кафедра гражданского права
    ('880e8400-e29b-41d4-a716-446655440004', '660e8400-e29b-41d4-a716-446655440004', 'Соломон Мудрый'),

    -- Юридический факультет, Кафедра уголовного права
    ('880e8400-e29b-41d4-a716-446655440005', '660e8400-e29b-41d4-a716-446655440005', 'Шерлок Холмс'),

    -- Информационно-вычислительных технологий факультет, Кафедра программирования
    ('880e8400-e29b-41d4-a716-446655440006', '660e8400-e29b-41d4-a716-446655440006', 'Билл Гейтс'),

    -- Информационно-вычислительных технологий факультет, Кафедра сетевых технологий
    ('880e8400-e29b-41d4-a716-446655440007', '660e8400-e29b-41d4-a716-446655440007', 'Лиза Симпсон');



INSERT INTO Student (student_id, faculty_id, department_id, ticket_number, full_name, enrollment_date, education_level, graduation_date, completion_status, is_archived, created_at, updated_at)
VALUES
    -- Математический факультет, Кафедра алгебры
    ('770e8400-e29b-41d4-a716-446655440001', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440000', 'MAT1002', 'Фролова Анна Олеговна', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440002', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440000', 'MAT1003', 'Васильев Игорь Александрович', '2022-09-01','master', NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440003', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440000', 'MAT1004', 'Николаева Елена Дмитриевна', '2022-09-01','master', NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440004', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440000', 'MAT1005', 'Смирнов Алексей Игоревич', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Математический факультет, Кафедра геометрии
    ('770e8400-e29b-41d4-a716-446655440005', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440001', 'MAT2001', 'Петрова Ольга Сергеевна', '2020-09-01','master', NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440006', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440001', 'MAT2002', 'Зайцев Андрей Михайлович', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440007', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440001', 'MAT2003', 'Кириллова Марина Ивановна', '2022-09-01','master', NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440008', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440001', 'MAT2004', 'Сидоров Алексей Викторович', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440009', '550e8400-e29b-41d4-a716-446655440000', '660e8400-e29b-41d4-a716-446655440001', 'MAT2005', 'Федорова Наталья Владимировна', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Исторический факультет, Кафедра отечественной истории
    ('770e8400-e29b-41d4-a716-446655440010', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440002', 'HIS1001', 'Ермаков Виктор Анатольевич', '2020-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440011', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440002', 'HIS1002', 'Лазарева Марина Петровна', '2021-09-01','master', NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440012', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440002', 'HIS1003', 'Соколов Вячеслав Андреевич', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440013', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440002', 'HIS1004', 'Никифорова Оксана Юрьевна', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440014', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440002', 'HIS1005', 'Григорьев Алексей Викторович', '2023-09-01','master', NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Исторический факультет, Кафедра всеобщей истории
    ('770e8400-e29b-41d4-a716-446655440015', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440003', 'HIS2001', 'Кравцова Елена Викторовна', '2020-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440016', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440003', 'HIS2002', 'Смирнова Наталья Игоревна', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440017', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440003', 'HIS2003', 'Курочкин Дмитрий Александрович', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440018', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440003', 'HIS2004', 'Зотов Илья Николаевич', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440019', '550e8400-e29b-41d4-a716-446655440001', '660e8400-e29b-41d4-a716-446655440003', 'HIS2005', 'Филатова Лариса Дмитриевна', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Юридический факультет, Кафедра гражданского права
    ('770e8400-e29b-41d4-a716-446655440020', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440004', 'LAW1001', 'Иванова Анастасия Сергеевна', '2020-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440021', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440004', 'LAW1002', 'Носов Артем Владимирович', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440022', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440004', 'LAW1003', 'Львова Виктория Павловна', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440023', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440004', 'LAW1004', 'Куликов Сергей Игоревич', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440024', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440004', 'LAW1005', 'Романова Екатерина Сергеевна', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Юридический факультет, Кафедра уголовного права
    ('770e8400-e29b-41d4-a716-446655440025', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440005', 'LAW2001', 'Васильев Владислав Александрович', '2020-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440026', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440005', 'LAW2002', 'Гусев Петр Николаевич', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440027', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440005', 'LAW2003', 'Семенова Алена Сергеевна', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440028', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440005', 'LAW2004', 'Лебедев Роман Викторович', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440029', '550e8400-e29b-41d4-a716-446655440002', '660e8400-e29b-41d4-a716-446655440005', 'LAW2005', 'Соловьева Светлана Анатольевна', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Информационно-вычислительных технологий факультет, Кафедра программирования
    ('770e8400-e29b-41d4-a716-446655440030', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440006', 'ICT1001', 'Тихонов Владислав Валерьевич', '2020-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440031', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440006', 'ICT1002', 'Кузьмина Алина Викторовна', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440032', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440006', 'ICT1003', 'Семенов Дмитрий Николаевич', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440033', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440006', 'ICT1004', 'Андреева Наталья Алексеевна', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440034', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440006', 'ICT1005', 'Медведев Роман Александрович', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),

    -- Информационно-вычислительных технологий факультет, Кафедра сетевых технологий
    ('770e8400-e29b-41d4-a716-446655440035', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440007', 'ICT2001', 'Захарова Ольга Сергеевна', '2020-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440036', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440007', 'ICT2002', 'Баранова Ксения Игоревна', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440037', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440007', 'ICT2003', 'Ковалев Сергей Николаевич', '2021-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440038', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440007', 'ICT2004', 'Гончарова Анна Игоревна', '2022-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP),
    ('770e8400-e29b-41d4-a716-446655440039', '550e8400-e29b-41d4-a716-446655440003', '660e8400-e29b-41d4-a716-446655440007', 'ICT2005', 'Давыдов Владислав Игоревич', '2023-09-01', 'master',NULL, NULL, FALSE, CURRENT_TIMESTAMP, CURRENT_TIMESTAMP);


INSERT INTO Coursework (coursework_id, student_id, supervisor_id, coursework_title, coursework_grade)
VALUES
    -- Математический факультет, Кафедра алгебры
--     ('990e8400-e29b-41d4-a716-446655440000', '770e8400-e29b-41d4-a716-446655440000', '880e8400-e29b-41d4-a716-446655440000', 'Как я пытался доказать теорему Ферма и что из этого вышло', 4),

    -- Математический факультет, Кафедра геометрии
    ('990e8400-e29b-41d4-a716-446655440001', '770e8400-e29b-41d4-a716-446655440005', '880e8400-e29b-41d4-a716-446655440001', 'Квадратные корни: как победить страх перед треугольниками', 5),

    -- Исторический факультет, Кафедра отечественной истории
    ('990e8400-e29b-41d4-a716-446655440002', '770e8400-e29b-41d4-a716-446655440010', '880e8400-e29b-41d4-a716-446655440002', 'Как Иван Грозный изобрел менеджмент страха', 3),

    -- Исторический факультет, Кафедра всеобщей истории
    ('990e8400-e29b-41d4-a716-446655440003', '770e8400-e29b-41d4-a716-446655440015', '880e8400-e29b-41d4-a716-446655440003', 'Александр Македонский и его план захвата соседней парты', 5),

    -- Юридический факультет, Кафедра гражданского права
    ('990e8400-e29b-41d4-a716-446655440004', '770e8400-e29b-41d4-a716-446655440020', '880e8400-e29b-41d4-a716-446655440004', 'Права на утренний кофе: юридический аспект', 4),

    -- Юридический факультет, Кафедра уголовного права
    ('990e8400-e29b-41d4-a716-446655440005', '770e8400-e29b-41d4-a716-446655440025', '880e8400-e29b-41d4-a716-446655440005', 'Дело о пропавших носках: уголовное расследование', 5),

    -- Информационно-вычислительных технологий факультет, Кафедра программирования
    ('990e8400-e29b-41d4-a716-446655440006', '770e8400-e29b-41d4-a716-446655440030', '880e8400-e29b-41d4-a716-446655440006', 'Почему Python не ест змей: философия языков программирования', 3),

    -- Информационно-вычислительных технологий факультет, Кафедра сетевых технологий
    ('990e8400-e29b-41d4-a716-446655440007', '770e8400-e29b-41d4-a716-446655440035', '880e8400-e29b-41d4-a716-446655440007', 'Как заставить роутер перестать мигать: практическое руководство', 4);

INSERT INTO Diploma (diploma_id, student_id, supervisor_id, diploma_title, diploma_grade)
VALUES
    -- Математический факультет, Кафедра алгебры
--     ('991e8400-e29b-41d4-a716-446655440000', '770e8400-e29b-41d4-a716-446655440000', '880e8400-e29b-41d4-a716-446655440000', 'Почему дважды два не всегда четыре: теория заговоров в математике', 5),

    -- Математический факультет, Кафедра геометрии
    ('991e8400-e29b-41d4-a716-446655440001', '770e8400-e29b-41d4-a716-446655440005', '880e8400-e29b-41d4-a716-446655440001', 'Параллельные линии: что если они всё-таки пересекаются?', 4),

    -- Исторический факультет, Кафедра отечественной истории
    ('991e8400-e29b-41d4-a716-446655440002', '770e8400-e29b-41d4-a716-446655440010', '880e8400-e29b-41d4-a716-446655440002', 'Как выжить в России XVI века: руководство для царей и простолюдинов', 3),

    -- Исторический факультет, Кафедра всеобщей истории
    ('991e8400-e29b-41d4-a716-446655440003', '770e8400-e29b-41d4-a716-446655440015', '880e8400-e29b-41d4-a716-446655440003', 'Александр Македонский и искусство переговоров с соседней деревней', 5),

    -- Юридический факультет, Кафедра гражданского права
    ('991e8400-e29b-41d4-a716-446655440004', '770e8400-e29b-41d4-a716-446655440020', '880e8400-e29b-41d4-a716-446655440004', 'Как доказать, что твой кот тебе ничего не должен: юридическая перспектива', 4),

    -- Юридический факультет, Кафедра уголовного права
    ('991e8400-e29b-41d4-a716-446655440005', '770e8400-e29b-41d4-a716-446655440025', '880e8400-e29b-41d4-a716-446655440005', 'Преступление и наказание: как соседи украли вай-фай', 5),

    -- Информационно-вычислительных технологий факультет, Кафедра программирования
    ('991e8400-e29b-41d4-a716-446655440006', '770e8400-e29b-41d4-a716-446655440030', '880e8400-e29b-41d4-a716-446655440006', 'Почему все баги — это фичи: философия программирования', 3),

    -- Информационно-вычислительных технологий факультет, Кафедра сетевых технологий
    ('991e8400-e29b-41d4-a716-446655440007', '770e8400-e29b-41d4-a716-446655440035', '880e8400-e29b-41d4-a716-446655440007', 'Как заставить интернет работать быстрее с помощью магии', 4);
